IDEA StatiCa Open Model
LoadingSLS.InternalForcesImperfection Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Internal forces of imperfection effect
 Namespace: IdeaRS.OpenModel.Concrete.Load
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public ResultOfInternalForces InternalForcesImperfection { get; set; }
Public Property InternalForcesImperfection As ResultOfInternalForces
	Get
	Set
public:
property ResultOfInternalForces^ InternalForcesImperfection {
	ResultOfInternalForces^ get ();
	void set (ResultOfInternalForces^ value);
}
Property Value
Type: ResultOfInternalForces
See Also
Reference
LoadingSLS Class
IdeaRS.OpenModel.Concrete.Load Namespace